results/pagination/run-2/pagination-cursor-500.log
COMMAND: make pagination TYPE=cursor CURSOR_DEPTH_PAGES=500 LIMIT=20

==== OUTPUT ====

k6 run \
	-e BASE_URL=http://3.39.39.25:3000/v1 \
	-e TYPE=cursor \
	-e LIMIT=20 \
	-e OFFSET= \
	-e CURSOR_DEPTH_PAGES=500 \
	loadtest/pagination.js

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: loadtest/pagination.js
        output: -

     scenarios: (100.00%) 1 scenario, 300 max VUs, 1m30s max duration (incl. graceful stop):
              * pagination_load: 100.00 iterations/s for 1m0s (maxVUs: 100-300, gracefulStop: 30s)


Run               [ 100% ] setup()
pagination_load   [   0% ]

Run               [ 100% ] setup()
pagination_load   [   0% ]

running (0m03.0s), 001/100 VUs, 71 complete and 0 interrupted iterations
pagination_load   [   1% ] 001/100 VUs  0m00.7s/1m0s  100.00 iters/s

running (0m04.0s), 001/100 VUs, 171 complete and 0 interrupted iterations
pagination_load   [   3% ] 001/100 VUs  0m01.7s/1m0s  100.00 iters/s

running (0m05.0s), 001/100 VUs, 271 complete and 0 interrupted iterations
pagination_load   [   5% ] 001/100 VUs  0m02.7s/1m0s  100.00 iters/s

running (0m06.0s), 001/100 VUs, 371 complete and 0 interrupted iterations
pagination_load   [   6% ] 001/100 VUs  0m03.7s/1m0s  100.00 iters/s

running (0m07.0s), 001/100 VUs, 471 complete and 0 interrupted iterations
pagination_load   [   8% ] 001/100 VUs  0m04.7s/1m0s  100.00 iters/s

running (0m08.0s), 001/100 VUs, 571 complete and 0 interrupted iterations
pagination_load   [  10% ] 001/100 VUs  0m05.7s/1m0s  100.00 iters/s

running (0m09.0s), 001/100 VUs, 671 complete and 0 interrupted iterations
pagination_load   [  11% ] 001/100 VUs  0m06.7s/1m0s  100.00 iters/s

running (0m10.0s), 001/100 VUs, 771 complete and 0 interrupted iterations
pagination_load   [  13% ] 001/100 VUs  0m07.7s/1m0s  100.00 iters/s

running (0m11.0s), 001/100 VUs, 871 complete and 0 interrupted iterations
pagination_load   [  15% ] 001/100 VUs  0m08.7s/1m0s  100.00 iters/s

running (0m12.0s), 001/100 VUs, 971 complete and 0 interrupted iterations
pagination_load   [  16% ] 001/100 VUs  0m09.7s/1m0s  100.00 iters/s

running (0m13.0s), 001/100 VUs, 1071 complete and 0 interrupted iterations
pagination_load   [  18% ] 001/100 VUs  0m10.7s/1m0s  100.00 iters/s

running (0m14.0s), 001/100 VUs, 1171 complete and 0 interrupted iterations
pagination_load   [  20% ] 001/100 VUs  0m11.7s/1m0s  100.00 iters/s

running (0m15.0s), 001/100 VUs, 1271 complete and 0 interrupted iterations
pagination_load   [  21% ] 001/100 VUs  0m12.7s/1m0s  100.00 iters/s

running (0m16.0s), 001/100 VUs, 1371 complete and 0 interrupted iterations
pagination_load   [  23% ] 001/100 VUs  0m13.7s/1m0s  100.00 iters/s

running (0m17.0s), 001/100 VUs, 1471 complete and 0 interrupted iterations
pagination_load   [  25% ] 001/100 VUs  0m14.7s/1m0s  100.00 iters/s

running (0m18.0s), 001/100 VUs, 1571 complete and 0 interrupted iterations
pagination_load   [  26% ] 001/100 VUs  0m15.7s/1m0s  100.00 iters/s

running (0m19.0s), 001/100 VUs, 1671 complete and 0 interrupted iterations
pagination_load   [  28% ] 001/100 VUs  0m16.7s/1m0s  100.00 iters/s

running (0m20.0s), 001/100 VUs, 1771 complete and 0 interrupted iterations
pagination_load   [  30% ] 001/100 VUs  0m17.7s/1m0s  100.00 iters/s

running (0m21.0s), 001/100 VUs, 1871 complete and 0 interrupted iterations
pagination_load   [  31% ] 001/100 VUs  0m18.7s/1m0s  100.00 iters/s

running (0m22.0s), 001/100 VUs, 1971 complete and 0 interrupted iterations
pagination_load   [  33% ] 001/100 VUs  0m19.7s/1m0s  100.00 iters/s

running (0m23.0s), 001/100 VUs, 2071 complete and 0 interrupted iterations
pagination_load   [  35% ] 001/100 VUs  0m20.7s/1m0s  100.00 iters/s

running (0m24.0s), 001/100 VUs, 2171 complete and 0 interrupted iterations
pagination_load   [  36% ] 001/100 VUs  0m21.7s/1m0s  100.00 iters/s

running (0m25.0s), 001/100 VUs, 2271 complete and 0 interrupted iterations
pagination_load   [  38% ] 001/100 VUs  0m22.7s/1m0s  100.00 iters/s

running (0m26.0s), 001/100 VUs, 2371 complete and 0 interrupted iterations
pagination_load   [  40% ] 001/100 VUs  0m23.7s/1m0s  100.00 iters/s

running (0m27.0s), 001/100 VUs, 2471 complete and 0 interrupted iterations
pagination_load   [  41% ] 001/100 VUs  0m24.7s/1m0s  100.00 iters/s

running (0m28.0s), 001/100 VUs, 2571 complete and 0 interrupted iterations
pagination_load   [  43% ] 001/100 VUs  0m25.7s/1m0s  100.00 iters/s

running (0m29.0s), 001/100 VUs, 2671 complete and 0 interrupted iterations
pagination_load   [  45% ] 001/100 VUs  0m26.7s/1m0s  100.00 iters/s

running (0m30.0s), 001/100 VUs, 2771 complete and 0 interrupted iterations
pagination_load   [  46% ] 001/100 VUs  0m27.7s/1m0s  100.00 iters/s

running (0m31.0s), 001/100 VUs, 2871 complete and 0 interrupted iterations
pagination_load   [  48% ] 001/100 VUs  0m28.7s/1m0s  100.00 iters/s

running (0m32.0s), 001/100 VUs, 2971 complete and 0 interrupted iterations
pagination_load   [  50% ] 001/100 VUs  0m29.7s/1m0s  100.00 iters/s

running (0m33.0s), 001/100 VUs, 3071 complete and 0 interrupted iterations
pagination_load   [  51% ] 001/100 VUs  0m30.7s/1m0s  100.00 iters/s

running (0m34.0s), 001/100 VUs, 3171 complete and 0 interrupted iterations
pagination_load   [  53% ] 001/100 VUs  0m31.7s/1m0s  100.00 iters/s

running (0m35.0s), 001/100 VUs, 3271 complete and 0 interrupted iterations
pagination_load   [  55% ] 001/100 VUs  0m32.7s/1m0s  100.00 iters/s

running (0m36.0s), 001/100 VUs, 3371 complete and 0 interrupted iterations
pagination_load   [  56% ] 001/100 VUs  0m33.7s/1m0s  100.00 iters/s

running (0m37.0s), 001/100 VUs, 3471 complete and 0 interrupted iterations
pagination_load   [  58% ] 001/100 VUs  0m34.7s/1m0s  100.00 iters/s

running (0m38.0s), 001/100 VUs, 3571 complete and 0 interrupted iterations
pagination_load   [  60% ] 001/100 VUs  0m35.7s/1m0s  100.00 iters/s

running (0m39.0s), 001/100 VUs, 3671 complete and 0 interrupted iterations
pagination_load   [  61% ] 001/100 VUs  0m36.7s/1m0s  100.00 iters/s

running (0m40.0s), 001/100 VUs, 3771 complete and 0 interrupted iterations
pagination_load   [  63% ] 001/100 VUs  0m37.7s/1m0s  100.00 iters/s

running (0m41.0s), 001/100 VUs, 3871 complete and 0 interrupted iterations
pagination_load   [  65% ] 001/100 VUs  0m38.7s/1m0s  100.00 iters/s

running (0m42.0s), 001/100 VUs, 3971 complete and 0 interrupted iterations
pagination_load   [  66% ] 001/100 VUs  0m39.7s/1m0s  100.00 iters/s

running (0m43.0s), 001/100 VUs, 4071 complete and 0 interrupted iterations
pagination_load   [  68% ] 001/100 VUs  0m40.7s/1m0s  100.00 iters/s

running (0m44.0s), 001/100 VUs, 4171 complete and 0 interrupted iterations
pagination_load   [  70% ] 001/100 VUs  0m41.7s/1m0s  100.00 iters/s

running (0m45.0s), 001/100 VUs, 4271 complete and 0 interrupted iterations
pagination_load   [  71% ] 001/100 VUs  0m42.7s/1m0s  100.00 iters/s

running (0m46.0s), 001/100 VUs, 4371 complete and 0 interrupted iterations
pagination_load   [  73% ] 001/100 VUs  0m43.7s/1m0s  100.00 iters/s

running (0m47.0s), 001/100 VUs, 4471 complete and 0 interrupted iterations
pagination_load   [  75% ] 001/100 VUs  0m44.7s/1m0s  100.00 iters/s

running (0m48.0s), 001/100 VUs, 4571 complete and 0 interrupted iterations
pagination_load   [  76% ] 001/100 VUs  0m45.7s/1m0s  100.00 iters/s

running (0m49.0s), 001/100 VUs, 4671 complete and 0 interrupted iterations
pagination_load   [  78% ] 001/100 VUs  0m46.7s/1m0s  100.00 iters/s

running (0m50.0s), 001/100 VUs, 4771 complete and 0 interrupted iterations
pagination_load   [  80% ] 001/100 VUs  0m47.7s/1m0s  100.00 iters/s

running (0m51.0s), 001/100 VUs, 4871 complete and 0 interrupted iterations
pagination_load   [  81% ] 001/100 VUs  0m48.7s/1m0s  100.00 iters/s

running (0m52.0s), 001/100 VUs, 4971 complete and 0 interrupted iterations
pagination_load   [  83% ] 001/100 VUs  0m49.7s/1m0s  100.00 iters/s

running (0m53.0s), 001/100 VUs, 5071 complete and 0 interrupted iterations
pagination_load   [  85% ] 001/100 VUs  0m50.7s/1m0s  100.00 iters/s

running (0m54.0s), 001/100 VUs, 5171 complete and 0 interrupted iterations
pagination_load   [  86% ] 001/100 VUs  0m51.7s/1m0s  100.00 iters/s

running (0m55.0s), 001/100 VUs, 5271 complete and 0 interrupted iterations
pagination_load   [  88% ] 001/100 VUs  0m52.7s/1m0s  100.00 iters/s

running (0m56.0s), 001/100 VUs, 5371 complete and 0 interrupted iterations
pagination_load   [  90% ] 001/100 VUs  0m53.7s/1m0s  100.00 iters/s

running (0m57.0s), 001/100 VUs, 5471 complete and 0 interrupted iterations
pagination_load   [  91% ] 001/100 VUs  0m54.7s/1m0s  100.00 iters/s

running (0m58.0s), 001/100 VUs, 5571 complete and 0 interrupted iterations
pagination_load   [  93% ] 001/100 VUs  0m55.7s/1m0s  100.00 iters/s

running (0m59.0s), 001/100 VUs, 5671 complete and 0 interrupted iterations
pagination_load   [  95% ] 001/100 VUs  0m56.7s/1m0s  100.00 iters/s

running (1m00.0s), 001/100 VUs, 5771 complete and 0 interrupted iterations
pagination_load   [  96% ] 001/100 VUs  0m57.7s/1m0s  100.00 iters/s

running (1m01.0s), 001/100 VUs, 5871 complete and 0 interrupted iterations
pagination_load   [  98% ] 001/100 VUs  0m58.7s/1m0s  100.00 iters/s

running (1m02.0s), 001/100 VUs, 5971 complete and 0 interrupted iterations
pagination_load   [ 100% ] 001/100 VUs  0m59.7s/1m0s  100.00 iters/s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<500' p(95)=4.99ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 6501    104.403508/s
    checks_succeeded...: 100.00% 6501 out of 6501
    checks_failed......: 0.00%   0 out of 6501

    ✓ setup status is 200
    ✓ status is 200

    HTTP
    http_req_duration..............: avg=4.49ms min=3.73ms med=4.43ms max=17.44ms p(90)=4.84ms p(95)=4.99ms
      { expected_response:true }...: avg=4.49ms min=3.73ms med=4.43ms max=17.44ms p(90)=4.84ms p(95)=4.99ms
    http_req_failed................: 0.00%  0 out of 6501
    http_reqs......................: 6501   104.403508/s

    EXECUTION
    iteration_duration.............: avg=4.63ms min=3.87ms med=4.57ms max=17.62ms p(90)=5.01ms p(95)=5.2ms 
    iterations.....................: 6001   96.373704/s
    vus............................: 1      min=0         max=1  
    vus_max........................: 100    min=100       max=100

    NETWORK
    data_received..................: 26 MB  415 kB/s
    data_sent......................: 702 kB 11 kB/s



running (1m02.3s), 000/100 VUs, 6001 complete and 0 interrupted iterations
pagination_load ✓ [ 100% ] 000/100 VUs  1m0s  100.00 iters/s